     A          R REFER
     A*
     A            ADID           5P 0       TEXT('ADDRESS ID')
     A                                      COLHDG('ADRES.' 'ID')
     A                                      EDTCDE(Z)
     A            ADRLINE       50          TEXT('ADDRESS LINE')
     A                                      COLHDG('ADDRESS' 'LINE')
     A            ARID           6          TEXT('ARTICLE ID')
     A                                      COLHDG('ART.' 'ID')
     A            ARDESC        50          TEXT('ARTICLE DESCRPTION')
     A                                      COLHDG('DESCRIPTION')
     A            CUID           5P 0       TEXT('CUSTOMER ID')
     A                                      COLHDG('CUST' 'ID')
     A                                      EDTCDE(Z)
     A            COID           2          TEXT('COUNTRY CODE')
     A                                      COLHDG('CO' 'ID')
     A            COUNTR        30          TEXT('COUNTRY NAME')
     A                                      COLHDG('COUNTRY' 'NAME')
     A            CITY          30          TEXT('CITY')
     A                                      COLHDG('CITY')
     A            CUSTNM        30          TEXT('CUSTOMER NAME')
     A                                      COLHDG('CUSTOMER' 'NAME')
     A            DLCODE         1          COLHDG('DEL' 'CD')
     A                                      TEXT('DELETE CODE X=DELETED')
     A            FAID           3          TEXT('FAMILLY ID')
     A                                      COLHDG('FAM' 'ID')
     A            FADESC        50          TEXT('FAMILLY DESCRIPTION')
     A                                      COLHDG('FAMILLY')
     A            EMAIL         50          TEXT('ADDRESS MAIL')
     A                                      COLHDG('ADDRESS' 'MAIL')
     A            ORID           6P 0       TEXT('ORDER NUMBER')
     A                                      COLHDG('ORD' 'NUM')
     A                                      EDTCDE(Z)
     A            ODLINE         5P 0       TEXT('ORDER LINE')
     A                                      COLHDG('ORD' 'LINE')
     A                                      EDTCDE(Z)
     A            PRID           5P 0       TEXT('PROVIDER ID')
     A                                      COLHDG('PROVIDER' 'ID')
     A                                      EDTCDE(Z)
     A            PROVNM        30          TEXT('PROVIDER NAME')
     A                                      COLHDG('PROVIDER' 'NAME')
     A            PHONE         15          TEXT('PHONE NUMBER')
     A                                      COLHDG('PHONE' 'NUMBER')
     A            QUANTITY       5  0       TEXT('QUANTITY')
     A                                      EDTCDE(Z)
     A                                      COLHDG('QTY')
     A            TOTPRICE       9P 2       TEXT('TOTAL PRICE')
     A                                      COLHDG('TOTAL' 'PRICE')
     A                                      EDTCDE(2)
     A            UNITPRICE      7P 2       TEXT('UNIT PRICE')
     A                                      COLHDG('UNIT' 'PRICE')
     A                                      EDTCDE(2)
     A            WHID           3          TEXT('WAREHOUSE ID')
     A                                      COLHDG('WHS' 'ID')
     A            VATCODE        1          TEXT('VAT CODE')
     A                                      COLHDG('VAT' 'CODE')
     A                                      DFT('2')
     A            VATRATE        4  2       TEXT('VAT RATE %')
     A                                      COLHDG('VAT' 'RATE %')
     A                                      EDTWRD('  ,  %')
     A            VATNUM        12          TEXT('VAT NUMBER')
     A                                      COLHDG('VAT' 'NUMBER')
     A            WHNAME        20          TEXT('WAREHOUSE NAME')
     A                                      COLHDG('WAREHOUSE')
     A            YEAR           4P 0       TEXT('YEAR')
     A                                      COLHDG('YEAR')
     A            ZIPCOD        10          TEXT('ZIP CODE')
     A                                      COLHDG('ZIP' 'CODE')
